[
  {
    "id": "wall-mounted-vase",
    "title": "Wall Mounted Vase",
    "subtitle": "A Minimalistic, Detachable Solution for Elegant Plant Display and Care",
    "description": "A minimalistic and functional 3D-printable wall-mounted vase, designed for easy watering, maintenance, and aesthetic appeal in compact living spaces.",
    "category": "Engineering & Prototyping",
    "featured": true,
    "image": "/wall-mounted-vase.png",
    "technologies": ["Prototyping", "Fusion 360", "Industrial Design"],
    "content": {
      "overview": "The plant vase project was created with the goal of providing a minimalistic, elegant, and functional solution for displaying plants on the wall. The design focuses on user experience, offering an easily detachable system that allows users to water their plants without mess. It also includes a convenient screw-on mechanism at the base for easy cleaning and maintenance. Designed in Fusion 360, the vase is optimized for 3D printing, making it both practical and accessible for anyone looking to elevate their plant care routine.",
      "background": "As urban living spaces become more compact, many people seek ways to incorporate plants into their homes without compromising on style or space. Traditional plant pots can be bulky and difficult to maintain, especially when placed in hard-to-reach areas. This project addresses the need for a wall-mounted plant display that combines elegance with practicality, allowing for easy plant care without creating additional mess or hassle. The challenge was to design a system that not only looks aesthetically pleasing but also prioritizes the user experience when it comes to watering and cleaning.",
      "objectives": [
        "To create a minimalist and elegant wall-mounted plant vase that enhances the user’s living space.",
        "To develop a system that is easy to detach from the wall, facilitating easy watering without spilling water or wetting the surrounding area.",
        "To design a bottom screw-on mechanism that allows for quick removal and cleaning of excess dirt and water.",
        "To make the design 3D-printable, ensuring that it is accessible for DIY enthusiasts and those with 3D printers."
      ],
      "implementation": "The vase was designed using Fusion 360, focusing on sleek lines and user-centric features. The attachment system was developed to ensure that the vase could be easily mounted and removed from the wall. The locking mechanism at the base is a crucial feature, allowing the user to screw on and off the bottom, facilitating the removal of dirt and water buildup. The design is fully optimized for 3D printing, ensuring a smooth printing process with easy assembly. The materials were chosen with durability in mind, ensuring that the vase is both sturdy and lightweight.",
      "challenges": "Ensuring that the vase could be securely mounted yet easily detachable was a key challenge. I solved this by designing a user-friendly locking mechanism that allows the vase to click into place and can be easily unscrewed for removal, ensuring both security and convenience. Watering plants in a wall-mounted vase without spilling or creating a mess was crucial. The screw-on bottom mechanism ensures excess water and dirt are contained and can be easily removed, preventing drips and making cleaning hassle-free.",
      "results": "The vase design successfully meets the project’s objectives, offering a sleek and user-friendly solution for wall-mounted plant display. The project not only adds an elegant touch to any home but also encourages a more practical approach to plant care, ensuring that both the plants and the home environment remain in top condition."
    }
  },
  {
    "id": "agrisync-inventory",
    "title": "AgriSync",
    "subtitle": "IoT Inventory Management for Heavy Duty and Agriculture Applications",
    "description": "An IoT-powered inventory management system for the agriculture industry, integrating smart scales with real-time data platforms to reduce waste and streamline procurement.",
    "category": "Engineering & Prototyping",
    "featured": true,
    "image": "/agrisync-inventory.png",
    "technologies": ["Embedded Systems", "IoT", "Prototyping", "Design System", "Lean", "Agile", "Kaizen", "Altium Designer", "Fusion 360"],
    "content": {
      "overview": "AgriSync is an IoT-driven inventory management system tailored for the agricultural sector, designed to automate tracking of critical farm supplies and streamline procurement. By integrating a smart pallet scale with a mobile and web platform, AgriSync provides real-time inventory insights, reduces waste, and enhances supply chain efficiency. The system empowers farmers with data-backed decisions while offering suppliers a direct channel to their market.",
      "background": "Traditional inventory tracking methods in agriculture—such as pen-and-paper logging or basic spreadsheets—are inefficient, error-prone, and lack real-time visibility. This leads to frequent overstocking or understocking, which negatively impacts cash flow and results in significant waste, especially with perishable goods. Existing software solutions are often too complex or require high manual input, discouraging adoption by farmers and their teams.",
      "objectives": [
        "To develop a user-friendly web and mobile platform for real-time inventory monitoring.",
        "To design and implement a rugged IoT pallet scale suitable for farm environments.",
        "To reduce inventory waste and improve forecasting with data insights and alerts.",
        "To enhance procurement through automated shopping lists and supplier connectivity.",
        "To create a scalable business model offering value to both farmers and suppliers."
      ],
      "implementation": "The AgriSync system comprises three key components:\n\n- **IoT Smart Scale**: A robust, pallet-sized scale using shear beam load cells and Nordic chipsets for wireless data transmission.\n- **Mobile and Web Platforms**: Developed using Flutter and Next.js, these platforms offer an intuitive interface for farmers with limited tech experience.\n- **Backend Infrastructure**: Built on Supabase, it supports secure data handling, GraphQL-based APIs, and real-time analytics. Azure DevOps is used for CI/CD and project tracking.",
      "challenges": "Connectivity in rural areas posed challenges, mitigated by enabling offline Bluetooth syncing. Ensuring simplicity in the UI helped with user adoption among non-tech-savvy users. Maintaining precision and durability under farm conditions required meticulous hardware engineering.",
      "results": "AgriSync has demonstrated potential to reduce waste, increase procurement efficiency, and improve farm profitability. The project earned 3rd place in the Capstone Fair’s Entrepreneurial category and validated its value proposition through positive early feedback."
    }
  },
  {
    "id": "findr-app",
    "title": "Findr",
    "subtitle": "Never Lose Your Friends at Large Events",
    "description": "A mobile app that helps users find and stay connected with friends during crowded events, with real-time tracking and communication features.",
    "category": "Digital Products & UI/UX Design",
    "featured": true,
    "image": "/findr-app.png",
    "technologies": ["UI/UX Design", "Design System", "Figma", "Prototyping"],
    "content": {
      "overview": "Findr is a mobile application designed to simplify the process of locating friends in large outdoor events. With the ability to create events, share locations, and communicate efficiently, Findr ensures everyone stays in touch no matter how busy or large the event is. The app is being developed in Flutter, with a target release for Calgary Stampede 2025.",
      "background": "At events like the Calgary Stampede, coordinating with friends across a vast venue can be frustrating. Inspired by personal experience, Findr was conceptualized to solve this problem by allowing real-time friend tracking and intuitive group coordination tools, reducing confusion and enhancing event experiences.",
      "objectives": [
        "To create an easy-to-use app that helps users find their friends in large, crowded events.",
        "To implement location sharing in real-time with event-based functionality.",
        "To design a system for sharing events with friends, enabling seamless tracking and communication.",
        "To include unique features like 'poking' and 'incognito' mode for attention and privacy.",
        "To apply a consistent design system using Figma for a polished, user-friendly interface."
      ],
      "implementation": "Following design thinking, the app was built in Figma with reusable UI components and a modern visual style. Key features include event creation, friend invites, live map tracking, and notification-driven actions like 'pokes'. The app is being developed in Flutter to ensure cross-platform deployment with consistent performance.",
      "challenges": "Designing a UI that was both easy to use in high-stress, fast-moving environments and visually engaging posed a challenge. I addressed this by focusing on clear, large touch targets, minimalistic icons, and a high-contrast color scheme to ensure legibility and quick navigation even in crowded settings. Integrating features like poking and incognito mode without overwhelming users with options required intuitive UI design. I created simple, contextual interactions that blended seamlessly into the app’s workflow, allowing users to toggle features with ease.",
      "results": "Findr has received enthusiastic feedback from potential users and is on track for its debut at Calgary Stampede 2025. The feature set and thoughtful design have positioned it as a helpful and fun tool for group event coordination."
    }
  },
  {
    "id": "solarcar-driver-board",
    "title": "Driver Controls Board & B3 Board",
    "subtitle": "UofC Solar Car Team Low Voltage PCB Stack",
    "description": "Two core PCBs—Driver Controls and B3 Board—designed for the University of Calgary Solar Car Team’s low voltage system, enabling efficient vehicle communication and control.",
    "category": "Engineering & Prototyping",
    "featured": true,
    "image": "/solarcar-driver-board.png",
    "technologies": ["Embedded Systems", "Prototyping", "Altium Designer"],
    "content": {
      "overview": "The Driver Controls Board and B3 Board were integral components of the low voltage system for the University of Calgary Solar Car Team's new vehicle, Helios. These boards enabled efficient communication and control between all major components of the vehicle, ensuring smooth operation of the car's driving functions.",
      "background": "As the team developed Helios, it became evident that simplifying the car’s electrical architecture would improve reliability and development speed. The B3 Stack was created as a modular system where the B3 Board served as a communication and power hub for all subsystems.",
      "objectives": [
        "To design the Driver Controls Board to capture essential driver inputs such as accelerator, brake, and mode switches.",
        "To create the B3 Board as the central controller managing SPI, USB, and CAN communications.",
        "To ensure signal integrity and power distribution across all connected boards.",
        "To develop a scalable system architecture supporting modularity and firmware unification."
      ],
      "implementation": "Using Altium Designer, the boards were developed through iterative prototyping. The Driver Controls Board focused on signal capture and minimal latency. The B3 Board integrated multiple protocols for system-wide control and power management. The stack layout and interconnection helped reduce complexity and physical wiring across the vehicle.",
      "challenges": "Managing multiple communication protocols (SPI, CAN, USB) on a compact PCB introduced risks of signal interference and integrity loss. Careful PCB layout strategies, including impedance matching and ground plane optimization, were used to maintain reliable communication.",
      "results": "The boards played a vital role in Helios’s low voltage system. They streamlined communication, simplified firmware development, and set a foundation for future system expansions. These contributions helped prepare the vehicle for upcoming solar racing competitions."
    }
  },
  {
    "id": "agrisync-ui",
    "title": "AgriSync UI/UX",
    "subtitle": "Designing UI/UX For Non-technical Users in Agricultural Environment",
    "description": "Designing UI/UX For Non-technical Users in Agricultural Environment",
    "category": "Digital Products & UI/UX Design",
    "featured": true,
    "image": "/agrisync-ui-ux.png",
    "technologies": ["UI/UX Design", "Figma", "Prototyping"],
    "content": {
      "overview": "AgriSync is an IoT-driven inventory management system tailored for the agricultural sector, designed to automate tracking of critical farm supplies and streamline procurement. By integrating a smart pallet scale with a mobile and web platform, AgriSync provides real-time inventory insights, reduces waste, and enhances supply chain efficiency. The system empowers farmers with data-backed decisions while offering suppliers a direct channel to their market. This project was executed by a group of 5 engineers as our Capstone Project and earned us a 3rd place medal in the Entrepreneurial category at the Capstone Fair. In this project, I played a leading role in UI/UX design across both the mobile and web platforms, ensuring the interface was intuitive and accessible for our target users: farmers with varying levels of technical literacy.",
      "background": "In agriculture, traditional inventory tracking methods—like handwritten logs or spreadsheets—are inefficient, error-prone, and lack real-time visibility. This often results in overstocking or understocking, which directly affects operational efficiency and can cause substantial waste, particularly with perishable goods. While digital solutions exist, they tend to be overly complex and demand high levels of manual input. AgriSync was created to fill this gap by offering a simple, effective, and user-focused platform designed with the farmer in mind.",
      "objectives": [
        "To develop a user-friendly mobile and web platform tailored to non-technical users.",
        "To ensure UI/UX decisions directly supported real-time inventory visibility and ease of operation.",
        "To create accessible visualizations for inventory trends, alerts, and supplier interactions.",
        "To validate the usability of the interface through feedback sessions with real users.",
        "To contribute to a platform that is not only functional but also enjoyable and efficient to use."
      ],
      "implementation": "I led the design process for both the Flutter-based mobile app and the Next.js (React) web dashboard. I conducted user research to understand pain points in current workflows, then wireframed and prototyped interfaces that aligned with those insights. The designs were implemented with responsiveness in mind, ensuring seamless experiences across devices. The inventory dashboard visualizes data using clean, interactive graphs, and alerts are color-coded and prioritized by urgency.",
      "challenges": "Farmers and field workers often prefer minimal text and straightforward interactions. I addressed this by favoring iconography, progressive disclosure of information, and clear visual hierarchies to guide user actions. Interfaces had to remain legible in bright sunlight and be operable with gloved hands. I validated the design on-site and adapted font sizes, button placements, and color contrasts accordingly. Ensuring that both the mobile and web platforms provided a cohesive experience required careful component reuse and shared styling principles.",
      "results": "The intuitive design significantly lowered the learning curve for first-time users, with positive feedback from farmers during testing sessions. Visual alerts and graphs helped users make faster, more informed decisions, enhancing day-to-day inventory management. The clean and accessible UI was a standout point during our Capstone Fair presentation, contributing to our 3rd place Entrepreneurial award. The UI/UX foundation I developed set the stage for future scalability and feature additions without compromising usability."
    }
  },
  {
    "id": "munitora",
    "title": "Munitora",
    "subtitle": "Livestock Management Solutions",
    "description": "Designing UI/UX For Non-technical Users in Agricultural Environment",
    "category": "Digital Products & UI/UX Design",
    "featured": true,
    "image": "/munitora-web.png",
    "technologies": ["UI/UX Design", "Figma", "Prototyping", "Design System", "Agile", "Lean", "Kaizen"],
    "content": {
      "overview": "Munitora is a livestock management startup transforming how cattle farmers operate by delivering AI-powered business intelligence through a fully integrated software solution. As Co-founder and CEO, I led the creation and development of our cross-platform application and directed a multidisciplinary team of 3 founders and 5 developers. We’ve secured over CA$100,000 in non-dilutive funding, onboarded five pilot farms, and are preparing for a full market launch in June 2025.",
      "background": "The cattle industry, particularly in Brazil and Canada, continues to struggle with manual, paper-based processes for herd and farm management. These outdated methods result in data inaccuracies, poor traceability, inefficiencies, and regulatory non-compliance. Motivated by co-founder Diogo Guaitolini’s firsthand experience as a seventh-generation cattle farmer, and backed by my expertise in lean management and UX design, and our team’s expertise in software development, Munitora was born to modernize farm operations and drive data-informed decision-making.",
      "objectives": [
        "To develop a cross-platform (mobile and web) application that simplifies cattle farm management through an intuitive and consistent user interface.",
        "To integrate RFID-based animal identification and data collection tools for enhanced traceability and precision livestock tracking.",
        "To implement AI-powered analytics and lean management principles that turn raw data into actionable insights for herd optimization.",
        "To streamline core operational processes including vaccination records, weight monitoring, employee management, and financial reporting."
      ],
      "implementation": "I led the product design and strategy, ensuring consistency across web and mobile platforms while introducing a scalable design system that streamlined our UI/UX workflow. The solution uses Bluetooth-enabled RFID readers and integrates digital scales and feeders with our cloud-based platform. Our backend aggregates animal-level data into actionable insights using proprietary algorithms grounded in lean manufacturing principles. This entire development was managed collaboratively through agile sprints, cross-functional coordination, and continuous user feedback.",
      "challenges": "One of the main challenges was maintaining UI/UX consistency across platforms while optimizing for offline functionality and hardware compatibility. By implementing a unified design system, I enabled the team to work more efficiently and maintain visual integrity. Another challenge was navigating the funding landscape—through diligent research, application writing, and pitch delivery, I led efforts that resulted in over CA$100,000 in non-dilutive funding, helping to sustain and scale our development.",
      "results": "We have five confirmed pilot farms and have tested early MVP features with promising feedback. Our system offers tangible benefits including reduced administrative workload, improved vaccination and weight tracking accuracy, and enhanced decision-making via AI insights. As a direct result of our strategy, we’ve been recognized in several startup competitions and accepted into top accelerator programs. With market launch slated for mid-2025, Munitora is positioned to be a category-defining solution in livestock tech."
    }
  },
  {
    "id": "theo",
    "title": "Theo",
    "subtitle": "Personal Financial Assistant",
    "description": "AI-powered WhatsApp assistant for personal finance tracking",
    "category": "Digital Products & UI/UX Design",
    "featured": true,
    "image": "/Theo-financial.png",
    "technologies": ["UI/UX Design", "Figma", "Prototyping", "Design System", "Agile"],
    "content": {
      "overview": "Theo is a personal financial assistant designed to help users manage their finances directly through WhatsApp. Users can submit incomes, expenses, and set financial goals simply by sending a message. An AI agent handles the organization and tracking of financial data, presenting it in a gamified, user-friendly dashboard. Theo was created to address personal struggles with financial tracking and has evolved into a SaaS product soon to be launched to the public.",
      "background": "The idea for Theo emerged from a personal need: managing expenses consistently without forgetting to log them. Initially, the workflow relied on Excel sheets connected to PowerBI dashboards—but the process was manual, repetitive, and easy to neglect. The absence of an intuitive and low-friction input method led to missed entries and inaccurate financial planning. Theo solves this by enabling expense and goal logging via WhatsApp, a platform users interact with daily. It also makes the experience enjoyable through gamified goals and achievements.",
      "objectives": [
        "To create a seamless way for users to track financial transactions using WhatsApp messages.",
        "To use AI to parse, categorize, and organize financial data autonomously.",
        "To build a dashboard that presents income, expenses, goals, and achievements in an intuitive format.",
        "To integrate gamification elements to encourage financial engagement and habit-building.",
        "To design a complete brand identity and user experience that is modern, friendly, and approachable.",
        "To develop a SaaS-ready solution for market release."
      ],
      "implementation": "Theo was developed as a collaborative effort. I led the project’s design and front-end development, including: Creating the brand book, logo, and visual identity (as seen in the Theo Brand Book). Designing all wireframes and the dashboard user interface. Implementing the front-end using modern frameworks. A friend assisted in developing the backend AI agent and WhatsApp integration, using natural language processing to interpret user messages and log transactions into a database. The final output is visualized in a web dashboard that shows cash flow, recent activity, recurring expenses, goals, and achievements.",
      "challenges": "One major challenge was ensuring users wouldn't drop off due to friction in the input process. Traditional apps often require multiple steps to log expenses, leading to low engagement. By integrating with WhatsApp, Theo leverages a daily-used platform, drastically reducing friction. Another challenge was making the experience fun—solved through a carefully designed gamification system, including badges and milestone tracking for savings, debt payoff, and investments.",
      "results": "Theo has proven to be a highly effective solution for simplifying personal finance management. Since its internal launch, users have consistently reported an increase in the frequency and accuracy of expense tracking. Theo successfully met its core objectives by making financial tracking frictionless, accessible, and fun—empowering users to build healthier money habits and gain control over their financial future. The project is now in its final development stage as a market-ready SaaS product."
    }
  }
]
